chibios-upstream/chibios-tools/tools/embsysregviewdata/data/ARM_Cortex-A5/Atmel/ATSAMA5D35.xml
        <register>
          <name>DRIVER2</name>
          <description>I/O Drive Register 2</description>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LINE16</name>
              <description>Drive of PIO line 16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE17</name>
              <description>Drive of PIO line 17</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE18</name>
              <description>Drive of PIO line 18</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE19</name>
              <description>Drive of PIO line 19</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE20</name>
              <description>Drive of PIO line 20</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE21</name>
              <description>Drive of PIO line 21</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE22</name>
              <description>Drive of PIO line 22</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE23</name>
              <description>Drive of PIO line 23</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE24</name>
              <description>Drive of PIO line 24</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE25</name>
              <description>Drive of PIO line 25</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE26</name>
              <description>Drive of PIO line 26</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE27</name>
              <description>Drive of PIO line 27</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE28</name>
              <description>Drive of PIO line 28</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE29</name>
              <description>Drive of PIO line 29</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE30</name>
              <description>Drive of PIO line 30</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE31</name>
              <description>Drive of PIO line 31</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
